DROP TABLE diaries;

CREATE TABLE `diaries` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` bigint(20) unsigned NOT NULL,
  `title` varchar(255) NOT NULL,
  `diary_date` date NOT NULL,
  `is_public` tinyint(1) NOT NULL,
  `body` text NOT NULL,
  `image` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;


INSERT INTO diaries (id,user_id,title,diary_date,is_public,body,image,created_at,updated_at) VALUES
(1,1,'日記タイトル1','2026-01-01', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(2,1,'日記タイトル2','2026-02-01', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(3,1,'日記タイトル3','2026-03-01', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(4,1,'日記タイトル4','2026-04-01', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(5,1,'日記タイトル5','2026-05-01', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(6,2,'日記タイトル6','2026-06-01', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(7,2,'日記タイトル7','2026-07-01', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(8,2,'日記タイトル8','2026-08-01', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(9,2,'日記タイトル9','2026-09-01', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(10,2,'日記タイトル10','2026-10-01', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(11,3,'日記タイトル11','2026-11-01', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(12,3,'日記タイトル12','2026-12-01', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(13,3,'日記タイトル13','2026-01-02', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(14,3,'日記タイトル14','2026-01-03', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(15,3,'日記タイトル15','2026-01-04', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(16,4,'日記タイトル16','2026-01-05', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(17,4,'日記タイトル17','2026-01-06', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(18,4,'日記タイトル18','2026-01-07', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(19,4,'日記タイトル19','2026-01-08', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(20,4,'日記タイトル20','2026-01-09', 1, '本日の日記本日の日記本日の日記本日の日記本日の日記','', now(), now()),
(21,5,'非公開日記タイトル21','2026-01-10', 0, '非公開非公開非公開非公開非公開非公開非公開非公開','', now(), now()),
(22,5,'非公開日記タイトル22','2026-01-11', 0, '非公開非公開非公開非公開非公開非公開非公開非公開','', now(), now()),
(23,5,'非公開日記タイトル23','2026-01-12', 0, '非公開非公開非公開非公開非公開非公開非公開非公開','', now(), now()),
(24,5,'非公開日記タイトル24','2026-01-13', 0, '非公開非公開非公開非公開非公開非公開非公開非公開','', now(), now()),
(25,5,'非公開日記タイトル25','2026-01-14', 0, '非公開非公開非公開非公開非公開非公開非公開非公開','', now(), now());
